Revit 2024 API
DockablePaneState.DockPosition Property
 Which part of the Revit application frame the pane should dock to.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public DockPosition DockPosition { get; set; }
Visual Basic
Public Property DockPosition As DockPosition
	Get
	Set
Visual C++
public:
property DockPosition DockPosition {
	DockPosition get ();
	void set (DockPosition value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
DockablePaneState Class
Autodesk.Revit.UI Namespace